docs/evaluator.org
* Base base
L'evaluator è "basato" sull'evaluator presente al capitolo =4.1= di [[https://web.mit.edu/6.001/6.037/sicp.pdf][Structure and Interpretation of Computer Programs]]
l'evaluator presente nel libro non è purtroppo progettato in maniera molto object oriented, e le idee di fondo di questo vanno riviste ai fini di non creare abominii.

** Idee del cazzo di lisp da tenere a mente
lisp è un linguaggio che sa essere abbastanza stronzo a volte, specie per quel povero crisitano che sta leggendo questo documento per capire che cazzo di codice ho scritto (pace all'anima sua)

ci sono due/tre particolarità di questo essere[fn::queste cazzate sarebbero più da scheme/common lisp, che sono quelli che ho usato come "ispirazione"] da tenere a mente quando andrete a soffrirvi sto interpreter
 1. La struttura dati base del lisp è la lista (concatenata), la struttura base che rappresenta il codice è la stessa cazzo di lista.
    questa struttura è descritta da un insieme di coppie di puntatori che contengono
    - un puntatore ~head~ (o ~car~) che punta al primo elemento della lista
    - un puntatore ~tail~ (o ~cdr~) che punta alla cella successiva della lista
    i nomi ~car~ e ~cdr~ sono più comuni, più che altro che sono lì dall'alba dei tempi e la gente ci si è abituata.
 2. Lisp è /"expression oriented"/, vale a dire, ogni espressione, ogni CAZZO di espressione, ritorna un valore, un if, un loop, un print, una definizione, un assegnamento... tutto.
 3. In lisp le funzioni sono variabili, anche un pover ~def fizzbuzz (n)~ sotto è una variabile (ahimè, una lambda), a cui è stato dato un nome per pietà
 4. In lisp le funzioni tengono traccia di tutte le variabili locali presenti quando queste sono state definite (vedre (su google) i termini =Closure=[fn::specificando che cerchi roba di programmazione, altrimenti ti vengono cose da Poggiolini sulla chiusura di un insieme rispetto a un'operazione] e =Lexical Binding=)

** Quello del libro
L'evaluator del libro è incentrato 2 funzioni
 - ~eval~ :: valuta un'espressione, ritornando il valore che assume
 - ~apply~ :: chiama questa funzione con questi argomenti ("applica" la funzione agli argomenti), e ritornami il valore ritornato dalla funzione

Le strutture dati principali dell'evaluator, oltre all'albero del codice che grazialcazzo, sono
 - ~environment~ :: "ambiente" dell'esecuzione, banalmente che cazzo di variaibili sono definite e che valore hanno, questo include, oltre alla variabili, le funzioni definite fino a quel momento.
 - ~procedure~ :: la funzione

** Funzioni del libro
*** Eval
**** Nel libro
il codice del libro per la funzione ~eval~ è sotto copiaincollato
#+begin_src scheme
  (define (eval exp env)
    (cond ((self-evaluating? exp) exp)
          ((variable? exp) (lookup-variable-value exp env))
          ((quoted? exp) (text-of-quotation exp))
          ((assignment? exp) (eval-assignment exp env))
          ((definition? exp) (eval-definition exp env))
          ((if? exp) (eval-if exp env))
          ((lambda? exp) (make-procedure (lambda-parameters

                                          (lambda-body exp)
                                          env))
           exp)
          ((begin? exp)
           (eval-sequence (begin-actions exp) env))
          ((cond? exp) (eval (cond->if exp) env))
          ((application? exp)

           (apply (eval (operator exp) env)
                  (list-of-values (operands exp) env)))

          (else
           (error "Unknown expression type: EVAL" exp))))
#+end_src
