docs/evaluator.tex
% Created 2023-09-21 Thu 13:31
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{color}
\usepackage{listings}
\author{Biggie Dickus}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Biggie Dickus},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.0.50 (Org mode 9.6.7)}, 
 pdflang={English}}

% Setup for code blocks [1/2]

\usepackage{fvextra}

\fvset{%
  commandchars=\\\{\},
  highlightcolor=white!95!black!80!blue,
  breaklines=true,
  breaksymbol=\color{white!60!black}\tiny\ensuremath{\hookrightarrow}}

% Make line numbers smaller and grey.
\renewcommand\theFancyVerbLine{\footnotesize\color{black!40!white}\arabic{FancyVerbLine}}

\usepackage{xcolor}

% In case engrave-faces-latex-gen-preamble has not been run.
\providecolor{EfD}{HTML}{f7f7f7}
\providecolor{EFD}{HTML}{28292e}

% Define a Code environment to prettily wrap the fontified code.
\usepackage[breakable,xparse]{tcolorbox}
\DeclareTColorBox[]{Code}{o}%
{colback=EfD!98!EFD, colframe=EfD!95!EFD,
  fontupper=\footnotesize\setlength{\fboxsep}{0pt},
  colupper=EFD,
  IfNoValueTF={#1}%
  {boxsep=2pt, arc=2.5pt, outer arc=2.5pt,
    boxrule=0.5pt, left=2pt}%
  {boxsep=2.5pt, arc=0pt, outer arc=0pt,
    boxrule=0pt, leftrule=1.5pt, left=0.5pt},
  right=2pt, top=1pt, bottom=0.5pt,
  breakable}

% Support listings with captions
\usepackage{float}
\floatstyle{plain}
\newfloat{listing}{htbp}{lst}
\newcommand{\listingsname}{Listing}
\floatname{listing}{\listingsname}
\newcommand{\listoflistingsname}{List of Listings}
\providecommand{\listoflistings}{\listof{listing}{\listoflistingsname}}


% Setup for code blocks [2/2]: syntax highlighting colors

\newcommand\efstrut{\vrule height 2.1ex depth 0.8ex width 0pt}
\definecolor{EFD}{HTML}{000000}
\definecolor{EfD}{HTML}{ffffff}
\newcommand{\EFD}[1]{\textcolor{EFD}{#1}} % default
\definecolor{EFh}{HTML}{7f7f7f}
\newcommand{\EFh}[1]{\textcolor{EFh}{#1}} % shadow
\definecolor{EFsc}{HTML}{228b22}
\newcommand{\EFsc}[1]{\textcolor{EFsc}{\textbf{#1}}} % success
\definecolor{EFw}{HTML}{ff8e00}
\newcommand{\EFw}[1]{\textcolor{EFw}{\textbf{#1}}} % warning
\definecolor{EFe}{HTML}{ff0000}
\newcommand{\EFe}[1]{\textcolor{EFe}{\textbf{#1}}} % error
\definecolor{EFc}{HTML}{b22222}
\newcommand{\EFc}[1]{\textcolor{EFc}{#1}} % font-lock-comment-face
\definecolor{EFcd}{HTML}{b22222}
\newcommand{\EFcd}[1]{\textcolor{EFcd}{#1}} % font-lock-comment-delimiter-face
\definecolor{EFs}{HTML}{8b2252}
\newcommand{\EFs}[1]{\textcolor{EFs}{#1}} % font-lock-string-face
\definecolor{EFd}{HTML}{8b2252}
\newcommand{\EFd}[1]{\textcolor{EFd}{#1}} % font-lock-doc-face
\definecolor{EFm}{HTML}{008b8b}
\newcommand{\EFm}[1]{\textcolor{EFm}{#1}} % font-lock-doc-markup-face
\definecolor{EFk}{HTML}{9370db}
\newcommand{\EFk}[1]{\textcolor{EFk}{#1}} % font-lock-keyword-face
\definecolor{EFb}{HTML}{483d8b}
\newcommand{\EFb}[1]{\textcolor{EFb}{#1}} % font-lock-builtin-face
\definecolor{EFf}{HTML}{0000ff}
\newcommand{\EFf}[1]{\textcolor{EFf}{#1}} % font-lock-function-name-face
\definecolor{EFv}{HTML}{a0522d}
\newcommand{\EFv}[1]{\textcolor{EFv}{#1}} % font-lock-variable-name-face
\definecolor{EFt}{HTML}{228b22}
\newcommand{\EFt}[1]{\textcolor{EFt}{#1}} % font-lock-type-face
\definecolor{EFo}{HTML}{008b8b}
\newcommand{\EFo}[1]{\textcolor{EFo}{#1}} % font-lock-constant-face
\definecolor{EFwr}{HTML}{ff0000}
\newcommand{\EFwr}[1]{\textcolor{EFwr}{\textbf{#1}}} % font-lock-warning-face
\newcommand{\EFnc}[1]{#1} % font-lock-negation-char-face
\definecolor{EFpp}{HTML}{483d8b}
\newcommand{\EFpp}[1]{\textcolor{EFpp}{#1}} % font-lock-preprocessor-face
\newcommand{\EFrc}[1]{\textbf{#1}} % font-lock-regexp-grouping-construct
\newcommand{\EFrb}[1]{\textbf{#1}} % font-lock-regexp-grouping-backslash
\newcommand{\EFob}[1]{#1} % org-block
\definecolor{EFhn}{HTML}{008b8b}
\newcommand{\EFhn}[1]{\textcolor{EFhn}{#1}} % highlight-numbers-number
\definecolor{EFhq}{HTML}{9370db}
\newcommand{\EFhq}[1]{\textcolor{EFhq}{#1}} % highlight-quoted-quote
\definecolor{EFhs}{HTML}{008b8b}
\newcommand{\EFhs}[1]{\textcolor{EFhs}{#1}} % highlight-quoted-symbol
\definecolor{EFrda}{HTML}{707183}
\newcommand{\EFrda}[1]{\textcolor{EFrda}{#1}} % rainbow-delimiters-depth-1-face
\definecolor{EFrdb}{HTML}{7388d6}
\newcommand{\EFrdb}[1]{\textcolor{EFrdb}{#1}} % rainbow-delimiters-depth-2-face
\definecolor{EFrdc}{HTML}{909183}
\newcommand{\EFrdc}[1]{\textcolor{EFrdc}{#1}} % rainbow-delimiters-depth-3-face
\definecolor{EFrdd}{HTML}{709870}
\newcommand{\EFrdd}[1]{\textcolor{EFrdd}{#1}} % rainbow-delimiters-depth-4-face
\definecolor{EFrde}{HTML}{907373}
\newcommand{\EFrde}[1]{\textcolor{EFrde}{#1}} % rainbow-delimiters-depth-5-face
\definecolor{EFrdf}{HTML}{6276ba}
\newcommand{\EFrdf}[1]{\textcolor{EFrdf}{#1}} % rainbow-delimiters-depth-6-face
\definecolor{EFrdg}{HTML}{858580}
\newcommand{\EFrdg}[1]{\textcolor{EFrdg}{#1}} % rainbow-delimiters-depth-7-face
\definecolor{EFrdh}{HTML}{80a880}
\newcommand{\EFrdh}[1]{\textcolor{EFrdh}{#1}} % rainbow-delimiters-depth-8-face
\definecolor{EFrdi}{HTML}{887070}
\newcommand{\EFrdi}[1]{\textcolor{EFrdi}{#1}} % rainbow-delimiters-depth-9-face
\begin{document}

\tableofcontents

\section{Base base}
\label{sec:orge75e878}
L'evaluator è "basato" sull'evaluator presente al capitolo \texttt{4.1} di \href{https://web.mit.edu/6.001/6.037/sicp.pdf}{Structure and Interpretation of Computer Programs}
l'evaluator presente nel libro non è purtroppo progettato in maniera molto object oriented, e le idee di fondo di questo vanno riviste ai fini di non creare abominii.

\subsection{Idee del cazzo di lisp da tenere a mente}
\label{sec:orgd5da389}
lisp è un linguaggio che sa essere abbastanza stronzo a volte, specie per quel povero crisitano che sta leggendo questo documento per capire che cazzo di codice ho scritto (pace all'anima sua)

ci sono due/tre particolarità di questo essere\footnote{queste cazzate sarebbero più da scheme/common lisp, che sono quelli che ho usato come "ispirazione"} da tenere a mente quando andrete a soffrirvi sto interpreter
\begin{enumerate}
\item La struttura dati base del lisp è la lista (concatenata), la struttura base che rappresenta il codice è la stessa cazzo di lista.
questa struttura è descritta da un insieme di coppie di puntatori che contengono
\begin{itemize}
\item un puntatore \texttt{head} (o \texttt{car}) che punta al primo elemento della lista
\item un puntatore \texttt{tail} (o \texttt{cdr}) che punta alla cella successiva della lista
\end{itemize}
i nomi \texttt{car} e \texttt{cdr} sono più comuni, più che altro che sono lì dall'alba dei tempi e la gente ci si è abituata.
\item Lisp è \emph{"expression oriented"}, vale a dire, ogni espressione, ogni CAZZO di espressione, ritorna un valore, un if, un loop, un print, una definizione, un assegnamento\ldots{} tutto.
\item In lisp le funzioni sono variabili, anche un pover \texttt{def fizzbuzz (n)} sotto è una variabile (ahimè, una lambda), a cui è stato dato un nome per pietà
\item In lisp le funzioni tengono traccia di tutte le variabili locali presenti quando queste sono state definite (vedre (su google) i termini \texttt{Closure}\footnote{specificando che cerchi roba di programmazione, altrimenti ti vengono cose da Poggiolini sulla chiusura di un insieme rispetto a un'operazione} e \texttt{Lexical Binding})
\end{enumerate}

\subsection{Quello del libro}
\label{sec:orgccd1639}
L'evaluator del libro è incentrato 2 funzioni
\begin{description}
\item[{\texttt{eval}}] valuta un'espressione, ritornando il valore che assume
\item[{\texttt{apply}}] chiama questa funzione con questi argomenti ("applica" la funzione agli argomenti), e ritornami il valore ritornato dalla funzione
\end{description}

Le strutture dati principali dell'evaluator, oltre all'albero del codice che grazialcazzo, sono
\begin{description}
\item[{\texttt{environment}}] "ambiente" dell'esecuzione, banalmente che cazzo di variaibili sono definite e che valore hanno, questo include, oltre alla variabili, le funzioni definite fino a quel momento.
\item[{\texttt{procedure}}] la funzione
\end{description}

\subsection{Funzioni del libro}
\label{sec:org9897c61}
\subsubsection{Eval}
\label{sec:org9f2ed5b}
\begin{enumerate}
\item Nel libro
\label{sec:orgc7aded5}
il codice del libro per la funzione \texttt{eval} è sotto copiaincollato
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFrda{(}\EFk{define} \EFrdb{(}\EFf{eval} exp env\EFrdb{)}
  \EFrdb{(}\EFk{cond} \EFrdc{(}\EFrdd{(}self-evaluating? exp\EFrdd{)} exp\EFrdc{)}
        \EFrdc{(}\EFrdd{(}variable? exp\EFrdd{)} \EFrdd{(}lookup-variable-value exp env\EFrdd{)}\EFrdc{)}
        \EFrdc{(}\EFrdd{(}quoted? exp\EFrdd{)} \EFrdd{(}text-of-quotation exp\EFrdd{)}\EFrdc{)}
        \EFrdc{(}\EFrdd{(}assignment? exp\EFrdd{)} \EFrdd{(}eval-assignment exp env\EFrdd{)}\EFrdc{)}
        \EFrdc{(}\EFrdd{(}definition? exp\EFrdd{)} \EFrdd{(}eval-definition exp env\EFrdd{)}\EFrdc{)}
        \EFrdc{(}\EFrdd{(}if? exp\EFrdd{)} \EFrdd{(}eval-if exp env\EFrdd{)}\EFrdc{)}
        \EFrdc{(}\EFrdd{(}lambda? exp\EFrdd{)} \EFrdd{(}make-procedure \EFrde{(}lambda-parameters

                                        \EFrdf{(}lambda-body exp\EFrdf{)}
                                        env\EFrde{)}\EFrdd{)}
         exp\EFrdc{)}
        \EFrdc{(}\EFrdd{(}begin? exp\EFrdd{)}
         \EFrdd{(}eval-sequence \EFrde{(}begin-actions exp\EFrde{)} env\EFrdd{)}\EFrdc{)}
        \EFrdc{(}\EFrdd{(}cond? exp\EFrdd{)} \EFrdd{(}eval \EFrde{(}cond->if exp\EFrde{)} env\EFrdd{)}\EFrdc{)}
        \EFrdc{(}\EFrdd{(}application? exp\EFrdd{)}

         \EFrdd{(}apply \EFrde{(}eval \EFrdf{(}operator exp\EFrdf{)} env\EFrde{)}
                \EFrde{(}list-of-values \EFrdf{(}operands exp\EFrdf{)} env\EFrde{)}\EFrdd{)}\EFrdc{)}

        \EFrdc{(}\EFk{else}
         \EFrdd{(}error \EFs{"Unknown expression type: EVAL"} exp\EFrdd{)}\EFrdc{)}\EFrdb{)}\EFrda{)}
\end{Verbatim}
\end{Code}
