docs/evaluator.org
**** Tradotto in java
questo, per mortali che toccano erba ed escono di casa, si traduce in una gigantesca catena di ~if-else~
#+begin_src java
  Value evaluate(Expression exp, Environment env) {
      if(isSelfEvaluating(exp))
          return exp;
      if(isVariable(exp))
          return env.lookupVariabile(exp);
      if(isQuoted(exp))
          return textOfQuotation(exp);
      if(isAssignment(exp)) {
          env.evalAssignment(exp);
          return cazzoNeSo;
      }
      if(isDefinition(exp)) {
          env.evalDefinition(exp);
          return cazzoNeSo;
      }
      if(isIf(exp)) {
          return evaluateIf(exp, env);
      }
      if(isLambda(exp)) {
          return new Procedure(Procedure.parametersOfExpression(exp),
                               Procedure.bodyOfExpression(exp),
                               env);
      }
      if(isSequence(exp)) {
          return evalSequence(exp);
      }
      if(isCond(exp)) {
          Expression ifs = translateCondToIfChain(exp);
          return evaluate(ifs);
      }
      if(isFuncall(exp)) {
          operator = evaluate(expressionOperator(exp));
          operands = evaluateAllInList(expressionOperands(exp));
          return applyFunction(operator, operands);
      }
      // arrivati qui abbiamo finito le operazioni che sappiamo fare
      // quindi non so che cazzo dirti,
      // se arrivo qui vuo dire che non so gestire l'espressione data
      // quindi ti becchi un'eccezione
      throw new InvalidArgumentException("cannot evaluate given expression");
  }
#+end_src
visto che non siamo yanderedev, questo si può riarchitetturare (tra gli altri modi) con un
***** Factory disabile
#+begin_src java
  public interface Evaluator {
      public Value evaluate(Expression exp, Environment env);
  }

  Value evaluate(Expression exp, Environment env) {
      Evaluaotr ev = EvaluatorPicker.determineEvaluator(exp);
      return ev.evaluate(exp, env);
  }

  /* ... */

  class EvaluatorPicker {
      public Evaluator determineEvaluator(exp) {
          if(isCompositeExpression(exp)) {
              return determineFromOperator(exp.getOperator());
          }
          else { // vale a dire, se l'espressione è atomica (un singolo nome o un letterale)
              if(isSymbol(exp))
                  return new LookupEvaluator();
              else
                  return new ConstantEvaluator();
          }
      }

      private Evaluator determineFromOperator(op) {
          String opName = op.getName();
          Evaluator ev = opnameEvaluatorMap.get(opname);
          if(ev == notFound) {
              // se non è un'operatore predefinito allora era una funzione normale
              return new FunctionApplicationEvaluator();

              // NOTA : non mi ricordo come si fa a dire in java "non è nella map"
              // quando lo trovo te lo metto bellino
          }
      }

      private HasMap opnameEvaluatorMap =
      {
          {"quote" : new QuoteEvaluator()},
          {"if" : new IfEvaluator()},
          {"set" : new AssignmentEvaluator()},
          {"define" : new DefinitionEvaluator()},
          {"lambda" : new LambdaEvaluator()},
          {"sequence" : new SequenceEvaluator()},
          {"cond" : new CondEvaluator()}
      };
  }
#+end_src

Se hai idee migliori di questo factory disabile sarei molto felice di sentirle, io le sto un po' finendo.
***** Factory meno disabile
Sarebbe anche possibile avere un ~Evaluable~ che viene costruito in base alla form, maragi definito come
#+begin_src java
  public interface Evaluable {
      Value evaluate(Environment env);
  }

#+end_src

#+begin_quote
NOTA 1: non so se sarbbe meglio passare l'env qui o averlo interno, per adesso mettiamo che viene passato, potrebbe cambiare
#+end_quote

#+begin_quote
NOTA 2: poi bisognerebbe trovare anche il modo di unificare il fatto che viene costruita da un'espressione, magari sarebbe meglio avere un'interfaccia che unisce ~evaluate()~ e un ~fromExpression()~
#+end_quote

#+begin_src java
  public class ConstantExpression implements Evaluable {
      /* ... */
  }

  public class FunctoinApplication implements Evaluable {
      /* ... */
  }
#+end_src

(al momento manco gli sbatti per scrivere questa cosa per intero, t'attacchi al cazzo, poi quando si implementa saranno cazzi)

*** Apply
per definire apply, ovvero l'applicazoine di procedure, dobbiamo un attimo vedere come sono definite le procedure all'interno del programma

**** Procedure
le procedure[fn::salvo quelle builtin, e magari delle foreign call, a cui devo pensare dopo come cazzo fare] sono, come detto sopra, delle variabili in questo caso degli oggetti, questi avranno
 - degli argomenti
 - un body (cazzo di codice contiene sta funzione)

risparmiando i dettagli saranno fatte tipo così
#+begin_src java
  class Procedure {
      LispList functionArguments;
      LispCode functionBody;

      Environment definitionEnvironment

          public Procedure(LispList arguments, LispList functionBody,
                           Environment definitionEnvironment) {
          this.functionArguments = functionArguments;
          this.functionBody = functionBody;
          this.definitionEnvironment = definitionEnvironment;
      }

      /* getter e setter e sticazzi */
  }
#+end_src

quello che ci interessa adesso è il metodo ~call~

