docs/evaluator.tex
\item Tradotto in java
\label{sec:orgdb96ddb}
questo, per mortali che toccano erba ed escono di casa, si traduce in una gigantesca catena di \texttt{if-else}
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFt{Value} \EFf{evaluate}\EFrda{(}\EFt{Expression} \EFv{exp}, \EFt{Environment} \EFv{env}\EFrda{)} \EFrda{\{}
    \EFk{if}\EFrdb{(}isSelfEvaluating\EFrdc{(}exp\EFrdc{)}\EFrdb{)}
        \EFk{return} exp;
    \EFk{if}\EFrdb{(}isVariable\EFrdc{(}exp\EFrdc{)}\EFrdb{)}
        \EFk{return} env.lookupVariabile\EFrdb{(}exp\EFrdb{)};
    \EFk{if}\EFrdb{(}isQuoted\EFrdc{(}exp\EFrdc{)}\EFrdb{)}
        \EFk{return} textOfQuotation\EFrdb{(}exp\EFrdb{)};
    \EFk{if}\EFrdb{(}isAssignment\EFrdc{(}exp\EFrdc{)}\EFrdb{)} \EFrdb{\{}
        env.evalAssignment\EFrdc{(}exp\EFrdc{)};
        \EFk{return} cazzoNeSo;
    \EFrdb{\}}
    \EFk{if}\EFrdb{(}isDefinition\EFrdc{(}exp\EFrdc{)}\EFrdb{)} \EFrdb{\{}
        env.evalDefinition\EFrdc{(}exp\EFrdc{)};
        \EFk{return} cazzoNeSo;
    \EFrdb{\}}
    \EFk{if}\EFrdb{(}isIf\EFrdc{(}exp\EFrdc{)}\EFrdb{)} \EFrdb{\{}
        \EFk{return} evaluateIf\EFrdc{(}exp, env\EFrdc{)};
    \EFrdb{\}}
    \EFk{if}\EFrdb{(}isLambda\EFrdc{(}exp\EFrdc{)}\EFrdb{)} \EFrdb{\{}
        \EFk{return} \EFk{new} \EFt{Procedure}\EFrdc{(}Procedure.parametersOfExpression\EFrdd{(}exp\EFrdd{)},
                             Procedure.bodyOfExpression\EFrdd{(}exp\EFrdd{)},
                             env\EFrdc{)};
    \EFrdb{\}}
    \EFk{if}\EFrdb{(}isSequence\EFrdc{(}exp\EFrdc{)}\EFrdb{)} \EFrdb{\{}
        \EFk{return} evalSequence\EFrdc{(}exp\EFrdc{)};
    \EFrdb{\}}
    \EFk{if}\EFrdb{(}isCond\EFrdc{(}exp\EFrdc{)}\EFrdb{)} \EFrdb{\{}
        \EFt{Expression} \EFv{ifs} = translateCondToIfChain\EFrdc{(}exp\EFrdc{)};
        \EFk{return} evaluate\EFrdc{(}ifs\EFrdc{)};
    \EFrdb{\}}
    \EFk{if}\EFrdb{(}isFuncall\EFrdc{(}exp\EFrdc{)}\EFrdb{)} \EFrdb{\{}
        operator = evaluate\EFrdc{(}expressionOperator\EFrdd{(}exp\EFrdd{)}\EFrdc{)};
        operands = evaluateAllInList\EFrdc{(}expressionOperands\EFrdd{(}exp\EFrdd{)}\EFrdc{)};
        \EFk{return} applyFunction\EFrdc{(}operator, operands\EFrdc{)};
    \EFrdb{\}}
    \EFcd{// }\EFc{arrivati qui abbiamo finito le operazioni che sappiamo fare}
    \EFcd{// }\EFc{quindi non so che cazzo dirti,}
    \EFcd{// }\EFc{se arrivo qui vuo dire che non so gestire l'espressione data}
    \EFcd{// }\EFc{quindi ti becchi un'eccezione}
    \EFk{throw} \EFk{new} \EFt{InvalidArgumentException}\EFrdb{(}\EFs{"cannot evaluate given expression"}\EFrdb{)};
\EFrda{\}}
\end{Verbatim}
\end{Code}
visto che non siamo yanderedev, questo si può riarchitetturare (tra gli altri modi) con un
\begin{enumerate}
\item Factory disabile
\label{sec:org60b07de}
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{public} \EFk{interface} \EFt{Evaluator} \EFrda{\{}
    \EFk{public} \EFt{Value} \EFf{evaluate}\EFrdb{(}\EFt{Expression} \EFv{exp}, \EFt{Environment} \EFv{env}\EFrdb{)};
\EFrda{\}}

\EFt{Value} \EFf{evaluate}\EFrda{(}\EFt{Expression} \EFv{exp}, \EFt{Environment} \EFv{env}\EFrda{)} \EFrda{\{}
    \EFt{Evaluaotr} \EFv{ev} = EvaluatorPicker.determineEvaluator\EFrdb{(}exp\EFrdb{)};
    \EFk{return} ev.evaluate\EFrdb{(}exp, env\EFrdb{)};
\EFrda{\}}

\EFcd{/* }\EFc{...}\EFcd{ */}

\EFk{class} \EFt{EvaluatorPicker} \EFrda{\{}
    \EFk{public} \EFt{Evaluator} \EFf{determineEvaluator}\EFrdb{(}\EFt{exp}\EFrdb{)} \EFrdb{\{}
        \EFk{if}\EFrdc{(}isCompositeExpression\EFrdd{(}exp\EFrdd{)}\EFrdc{)} \EFrdc{\{}
            \EFk{return} determineFromOperator\EFrdd{(}exp.getOperator\EFrde{(}\EFrde{)}\EFrdd{)};
        \EFrdc{\}}
        \EFk{else} \EFrdc{\{} \EFcd{// }\EFc{vale a dire, se l'espressione è atomica (un singolo nome o un letterale)}
            \EFk{if}\EFrdd{(}isSymbol\EFrde{(}exp\EFrde{)}\EFrdd{)}
                \EFk{return} \EFk{new} \EFt{LookupEvaluator}\EFrdd{(}\EFrdd{)};
            \EFk{else}
                \EFk{return} \EFk{new} \EFt{ConstantEvaluator}\EFrdd{(}\EFrdd{)};
        \EFrdc{\}}
    \EFrdb{\}}

    \EFk{private} \EFt{Evaluator} \EFf{determineFromOperator}\EFrdb{(}\EFt{op}\EFrdb{)} \EFrdb{\{}
        \EFt{String} \EFv{opName} = op.getName\EFrdc{(}\EFrdc{)};
        \EFt{Evaluator} \EFv{ev} = opnameEvaluatorMap.get\EFrdc{(}opname\EFrdc{)};
        \EFk{if}\EFrdc{(}ev == notFound\EFrdc{)} \EFrdc{\{}
            \EFcd{// }\EFc{se non è un'operatore predefinito allora era una funzione normale}
            \EFk{return} \EFk{new} \EFt{FunctionApplicationEvaluator}\EFrdd{(}\EFrdd{)};

            \EFcd{// }\EFc{NOTA : non mi ricordo come si fa a dire in java "non è nella map"}
            \EFcd{// }\EFc{quando lo trovo te lo metto bellino}
        \EFrdc{\}}
    \EFrdb{\}}

    \EFk{private} \EFt{HasMap} \EFv{opnameEvaluatorMap} =
    \EFrdb{\{}
        \EFrdc{\{}\EFs{"quote"} : \EFk{new} \EFt{QuoteEvaluator}\EFrdd{(}\EFrdd{)}\EFrdc{\}},
        \EFrdc{\{}\EFs{"if"} : \EFk{new} \EFt{IfEvaluator}\EFrdd{(}\EFrdd{)}\EFrdc{\}},
        \EFrdc{\{}\EFs{"set"} : \EFk{new} \EFt{AssignmentEvaluator}\EFrdd{(}\EFrdd{)}\EFrdc{\}},
        \EFrdc{\{}\EFs{"define"} : \EFk{new} \EFt{DefinitionEvaluator}\EFrdd{(}\EFrdd{)}\EFrdc{\}},
        \EFrdc{\{}\EFs{"lambda"} : \EFk{new} \EFt{LambdaEvaluator}\EFrdd{(}\EFrdd{)}\EFrdc{\}},
        \EFrdc{\{}\EFs{"sequence"} : \EFk{new} \EFt{SequenceEvaluator}\EFrdd{(}\EFrdd{)}\EFrdc{\}},
        \EFrdc{\{}\EFs{"cond"} : \EFk{new} \EFt{CondEvaluator}\EFrdd{(}\EFrdd{)}\EFrdc{\}}
    \EFrdb{\}};
\EFrda{\}}
\end{Verbatim}
\end{Code}

Se hai idee migliori di questo factory disabile sarei molto felice di sentirle, io le sto un po' finendo.
\item Factory meno disabile
\label{sec:org37f9f33}
Sarebbe anche possibile avere un \texttt{Evaluable} che viene costruito in base alla form, maragi definito come
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{public} \EFk{interface} \EFt{Evaluable} \EFrda{\{}
    \EFt{Value} \EFf{evaluate}\EFrdb{(}\EFt{Environment} \EFv{env}\EFrdb{)};
\EFrda{\}}

\end{Verbatim}
\end{Code}

\begin{quote}
NOTA 1: non so se sarbbe meglio passare l'env qui o averlo interno, per adesso mettiamo che viene passato, potrebbe cambiare
\end{quote}

\begin{quote}
NOTA 2: poi bisognerebbe trovare anche il modo di unificare il fatto che viene costruita da un'espressione, magari sarebbe meglio avere un'interfaccia che unisce \texttt{evaluate()} e un \texttt{fromExpression()}
\end{quote}

\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{public} \EFk{class} \EFt{ConstantExpression} \EFk{implements} \EFt{Evaluable} \EFrda{\{}
    \EFcd{/* }\EFc{...}\EFcd{ */}
\EFrda{\}}

\EFk{public} \EFk{class} \EFt{FunctoinApplication} \EFk{implements} \EFt{Evaluable} \EFrda{\{}
    \EFcd{/* }\EFc{...}\EFcd{ */}
\EFrda{\}}
\end{Verbatim}
\end{Code}

(al momento manco gli sbatti per scrivere questa cosa per intero, t'attacchi al cazzo, poi quando si implementa saranno cazzi)
\end{enumerate}
\end{enumerate}

\subsubsection{Apply}
\label{sec:orgf2297d5}
per definire apply, ovvero l'applicazoine di procedure, dobbiamo un attimo vedere come sono definite le procedure all'interno del programma

\begin{enumerate}
\item Procedure
\label{sec:orgdc104bb}
le procedure\footnote{salvo quelle builtin, e magari delle foreign call, a cui devo pensare dopo come cazzo fare} sono, come detto sopra, delle variabili in questo caso degli oggetti, questi avranno
\begin{itemize}
\item degli argomenti
\item un body (cazzo di codice contiene sta funzione)
\end{itemize}

risparmiando i dettagli saranno fatte tipo così
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{class} \EFt{Procedure} \EFrda{\{}
    \EFt{LispList} \EFv{functionArguments};
    \EFt{LispCode} \EFv{functionBody};

    Environment \EFt{definitionEnvironment}

        \EFk{public} \EFf{Procedure}\EFrdb{(}\EFt{LispList} \EFv{arguments}, \EFt{LispList} \EFv{functionBody},
                         \EFt{Environment} \EFv{definitionEnvironment}\EFrdb{)} \EFrdb{\{}
        \EFk{this}.functionArguments = functionArguments;
        \EFk{this}.functionBody = functionBody;
        \EFk{this}.definitionEnvironment = definitionEnvironment;
    \EFrdb{\}}

    \EFcd{/* }\EFc{getter e setter e sticazzi}\EFcd{ */}
\EFrda{\}}
\end{Verbatim}
\end{Code}

quello che ci interessa adesso è il metodo \texttt{call}
