docs/evaluator.org
**** Tornando ad ~apply~
dato il ~Procedure.call(arguments)~ sopra definito è abbastanza facile definire ~apply~, prima però la definizione del libro, per documentazoine

#+begin_src scheme
  (define (apply procedure arguments)
    (cond ((primitive-procedure? procedure)
           (apply-primitive-procedure procedure arguments))
          ((compound-procedure? procedure)
           (eval-sequence
            (procedure-body procedure)
            (extend-environment
             (procedure-parameters procedure)
             arguments
             (procedure-environment procedure))))
          (else
           (error
            "Unknown procedure type: APPLY" procedure))))
#+end_src

che tradotta brutalmente darebbe
#+begin_src java
  Value applyProcedure(Procedure proc, LispList args) {
      if (proc.isPrimitiveProcedure()) {
          return applyPrimitive(proc, args);
      }
      if (proc.isCompoundProcedure()) {
          return evalSequence(proc.getBody(),
                              proc.getEnvironment().extend(proc.getArglist,
                                                           args));
      }
  }
#+end_src

#+begin_quote
NOTA : ~Environment.extend()~ rende un ~Environment~ con gli stessi binding di ~this~ a cui si aggiungono poi tutti i nomi dell'~arglist~ a cui vengono assegnati tutti i valor dell'~args~ dato, veda il lettore se va bene come interfaccia
#+end_quote

si nota qui un dispatch esplicito sul "tipo", una bestemmia per ogni apprezzatore di orientazione a oggetti[fn::e di un minimo di scalabilità], una traduzione un po' più javanese potrebbe essere.
#+begin_src java
  public interface LispCallable {
      public Value call(LispList givenArguments);
  }

  public class BuiltinFunction implements LispCallable {
      /* devo ancora vedere come fare la cosa del builtin, mi spiace */

      @Override
      public Value call(LispList givenArguments) {
          /* il dispatch so' cazzo tua farlo mo' */
      }
  }

  public class UserDefinedFunction implements LispCallable {
      private LispCode functionBody;
      private LispList formalParameters;
      // nome figo per dire "i nomi degli argomenti che devi passarmi"
      private Environment definitionEnvironment;

      public UserDefinedFunction(LispCode functionBody,
                                 LispList formalParameters,
                                 Environment definitionEnvironment) {
          this.functionBody = functionBody;
          this.formalParameters = formalParameters;
          this.definitionEnvironment = definitionEnvironment;
      }

      @Override
      public Value call(LispList givenArguments) {
          Environment extendedEnvironment =
              definitionEnvironment.extend(formalParameters, givenArguments);
          return evalSequence(functionBody, extendedEnvironment);
      }
  }
#+end_src

e, avendo tradotto l'infame dispatch in polimorfismo come piace al vicario, si può tradurre ~apply~ semplicemente come un
#+begin_src java
  Value apply(Procedure proc, LispList vals) {
      return proc.call(vals);
  }
#+end_src

