docs/evaluator.tex

\item Tornando ad \texttt{apply}
\label{sec:org3f4825d}
dato il \texttt{Procedure.call(arguments)} sopra definito è abbastanza facile definire \texttt{apply}, prima però la definizione del libro, per documentazoine

\begin{Code}
\begin{Verbatim}
\color{EFD}\EFrda{(}\EFk{define} \EFrdb{(}\EFf{apply} procedure arguments\EFrdb{)}
  \EFrdb{(}\EFk{cond} \EFrdc{(}\EFrdd{(}primitive-procedure? procedure\EFrdd{)}
         \EFrdd{(}apply-primitive-procedure procedure arguments\EFrdd{)}\EFrdc{)}
        \EFrdc{(}\EFrdd{(}compound-procedure? procedure\EFrdd{)}
         \EFrdd{(}eval-sequence
          \EFrde{(}procedure-body procedure\EFrde{)}
          \EFrde{(}extend-environment
           \EFrdf{(}procedure-parameters procedure\EFrdf{)}
           arguments
           \EFrdf{(}procedure-environment procedure\EFrdf{)}\EFrde{)}\EFrdd{)}\EFrdc{)}
        \EFrdc{(}\EFk{else}
         \EFrdd{(}error
          \EFs{"Unknown procedure type: APPLY"} procedure\EFrdd{)}\EFrdc{)}\EFrdb{)}\EFrda{)}
\end{Verbatim}
\end{Code}

che tradotta brutalmente darebbe
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFt{Value} \EFf{applyProcedure}\EFrda{(}\EFt{Procedure} \EFv{proc}, \EFt{LispList} \EFv{args}\EFrda{)} \EFrda{\{}
    \EFk{if} \EFrdb{(}proc.isPrimitiveProcedure\EFrdc{(}\EFrdc{)}\EFrdb{)} \EFrdb{\{}
        \EFk{return} applyPrimitive\EFrdc{(}proc, args\EFrdc{)};
    \EFrdb{\}}
    \EFk{if} \EFrdb{(}proc.isCompoundProcedure\EFrdc{(}\EFrdc{)}\EFrdb{)} \EFrdb{\{}
        \EFk{return} evalSequence\EFrdc{(}proc.getBody\EFrdd{(}\EFrdd{)},
                            proc.getEnvironment\EFrdd{(}\EFrdd{)}.extend\EFrdd{(}proc.getArglist,
                                                         args\EFrdd{)}\EFrdc{)};
    \EFrdb{\}}
\EFrda{\}}
\end{Verbatim}
\end{Code}

\begin{quote}
NOTA : \texttt{Environment.extend()} rende un \texttt{Environment} con gli stessi binding di \texttt{this} a cui si aggiungono poi tutti i nomi dell'\texttt{arglist} a cui vengono assegnati tutti i valor dell'\texttt{args} dato, veda il lettore se va bene come interfaccia
\end{quote}

si nota qui un dispatch esplicito sul "tipo", una bestemmia per ogni apprezzatore di orientazione a oggetti\footnote{e di un minimo di scalabilità}, una traduzione un po' più javanese potrebbe essere.
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{public} \EFk{interface} \EFt{LispCallable} \EFrda{\{}
    \EFk{public} \EFt{Value} \EFf{call}\EFrdb{(}\EFt{LispList} \EFv{givenArguments}\EFrdb{)};
\EFrda{\}}

\EFk{public} \EFk{class} \EFt{BuiltinFunction} \EFk{implements} \EFt{LispCallable} \EFrda{\{}
    \EFcd{/* }\EFc{devo ancora vedere come fare la cosa del builtin, mi spiace}\EFcd{ */}

    \textcolor[HTML]{008b8b}{@Override}
    \EFk{public} \EFt{Value} \EFf{call}\EFrdb{(}\EFt{LispList} \EFv{givenArguments}\EFrdb{)} \EFrdb{\{}
        \EFcd{/* }\EFc{il dispatch so' cazzo tua farlo mo'}\EFcd{ */}
    \EFrdb{\}}
\EFrda{\}}

\EFk{public} \EFk{class} \EFt{UserDefinedFunction} \EFk{implements} \EFt{LispCallable} \EFrda{\{}
    \EFk{private} \EFt{LispCode} \EFv{functionBody};
    \EFk{private} \EFt{LispList} \EFv{formalParameters};
    \EFcd{// }\EFc{nome figo per dire "i nomi degli argomenti che devi passarmi"}
    \EFk{private} \EFt{Environment} \EFv{definitionEnvironment};

    \EFk{public} \EFf{UserDefinedFunction}\EFrdb{(}\EFt{LispCode} \EFv{functionBody},
                               \EFt{LispList} \EFv{formalParameters},
                               \EFt{Environment} \EFv{definitionEnvironment}\EFrdb{)} \EFrdb{\{}
        \EFk{this}.functionBody = functionBody;
        \EFk{this}.formalParameters = formalParameters;
        \EFk{this}.definitionEnvironment = definitionEnvironment;
    \EFrdb{\}}

    \textcolor[HTML]{008b8b}{@Override}
    \EFk{public} \EFt{Value} \EFf{call}\EFrdb{(}\EFt{LispList} \EFv{givenArguments}\EFrdb{)} \EFrdb{\{}
        \EFt{Environment} \EFv{extendedEnvironment} =
            definitionEnvironment.extend\EFrdc{(}formalParameters, givenArguments\EFrdc{)};
        \EFk{return} evalSequence\EFrdc{(}functionBody, extendedEnvironment\EFrdc{)};
    \EFrdb{\}}
\EFrda{\}}
\end{Verbatim}
\end{Code}

e, avendo tradotto l'infame dispatch in polimorfismo come piace al vicario, si può tradurre \texttt{apply} semplicemente come un
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFt{Value} \EFf{apply}\EFrda{(}\EFt{Procedure} \EFv{proc}, \EFt{LispList} \EFv{vals}\EFrda{)} \EFrda{\{}
    \EFk{return} proc.call\EFrdb{(}vals\EFrdb{)};
\EFrda{\}}
\end{Verbatim}
\end{Code}
\end{enumerate}
\end{document}